import React from 'react'
import MainList from './MainList';


const RECIPES = [
  {
    id: "r1",
    title: "Улитки по-бургундски",
    imageURL:
      "https://img.iamcook.ru/2022/upl/recipes/cat/u-33abb9ac8dbc09e86835fe6c0f829ce9.JPG",
    recipe: [
      "Улитки виноградные - 14-15 шт.",

      "Масло сливочное - 100 г",

      "Лук зеленый - 6-7 г",

      "Укроп - 4 г",

      "Соль - 3 щепотки",

      "Лавровый лист - 2 шт.",

      "Приправа «Французские травы» - 0,5 ч.л.",

      "Вино белое - 120 мл",

      "Вода горячая - 120 мл",

      "Чеснок - 2 зубчика",
    ],
  },
  {
    id: "r2",
    title: "Наггетсы как в макдональдсе",
    imageURL:
      "https://img.iamcook.ru/2022/upl/recipes/cat/u-68dc203eff20c127bdbd5cfb5619f082.jpg",
    recipe: [
      "Филе куриное - 300 г",

      "Яйцо куриное - 2 шт.",

      "Батон белый - 100 г",

      "Соль и перец - по вкусу",

      "Сухари панировочные - 150 г",

      "Масло растительное - для жарки",
    ],
  },
  {
    id: "r3",
    title: "Куриные стрипсы как в KFC",
    imageURL:
      "https://img.iamcook.ru/2020/upl/recipes/cat/u9661-6c6dde122d23048d8b0bbfbfdcbf6b4c.jpg",
    recipe: [
      "Куриное филе - 500 г",

      "Паприка - 1 ст.л. (+1 ч.л.)",

      "Молотый имбирь - 1 ч.л.",

      "Молотый чеснок - 1 ч.л.",

      "Приправа для курицы - 1 ч.л.",

      "Острый перец - по вкусу",

      "Мука - 200 г",

      "Масло растительное - для жарки",

      "Соль и перец ч.м. - по вкусу",
    ],
  },
];

function MainPage() {

    return (
        <MainList items={RECIPES} />
    );
}

export default MainPage;